---
title: LightGroup
classe: Autodesk.Revit.DB.Lighting.LightGroup
namespace: Autodesk.Revit.DB.Lighting
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# LightGroup

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElementId Id { get; }` | `lightGroup.Id` | ElementId |
| `Boolean IsValidObject { get; }` | `lightGroup.IsValidObject` | Boolean |
| `String Name { get; set; }` | `lightGroup.Name` | String |
| `Void AddLight(ElementId)` | `lightGroup.AddLight(lightId)` | Void |
| `Void Dispose()` | `lightGroup.Dispose()` | Void |
| `ICollection<ElementId> GetLights()` | `lightGroup.GetLights()` | ICollection<ElementId> |
| `Void RemoveLight(ElementId)` | `lightGroup.RemoveLight(lightId)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```